[
  {
    "VegetableId": 4,
    "VegetableCode": "001",
    "CatalogId": 14,
    "Name": "Zanahoria",
    "Description": "Una verdura de raíz versátil comúnmente naranja, pero también disponible en variedades moradas, rojas, amarillas y blancas. Las zanahorias son conocidas por su sabor dulce y alto contenido de betacaroteno, lo que las convierte en una adición nutritiva a las comidas.",
    "ThumbnailImage": "https://www.azamsharp.com/images/carrot.png",
    "SeedDepth": "1/4-1/2\" (6-13 mm)",
    "GerminationSoilTemp": "75 F (24 C)",
    "DaysToGermination": 6,
    "SowIndoors": "No recomendado",
    "SowOutdoors": "Primavera a verano",
    "PhRange": "5.5-6.5",
    "GrowingSoilTemp": "60-70 F (16-21 C)",
    "SpacingBeds": "2\" (5 cm)",
    "Watering": "Moderado",
    "Light": "Sol completo",
    "GoodCompanions": "Frijol, col, cebollín, lechuga de hoja",
    "BadCompanions": "Apio, eneldo, chirivía",
    "SowingDescription": "\r",
    "GrowingDescription": "Las semillas comenzarán a brotar en un par de semanas. Al regar las semillas, asegúrate de evitar mojar las hojas. El mojado de las hojas puede resultar en agujeros quemados en las hojas por el sol.",
    "HarvestDescription": "Cosecha las zanahorias cuando el trozo que sobresale del suelo tenga el diámetro de una moneda de 25 centavos. Desentiérralas cuidadosamente para no dañar la raíz.",
    "Active": null,
    "Season": "Primavera,Otoño,Verano,Invierno",
    "DaysToHarvestSeeds": 90,
    "DaysToHarvestSeedlings": 70,
    "HealthBenefits": "Rica en betacaroteno, las zanahorias promueven la salud ocular, fortalecen la inmunidad y apoyan la piel saludable.",
    "Pests": [
      {
        "name": "Mosca de la Zanahoria",
        "description": "La mosca de la zanahoria (Psila rosae) es un insecto pequeño de cuerpo negro con cabeza y patas naranjas. Es una plaga común que afecta zanahorias, chirivías, apio y otras plantas de la familia Apiaceae. Las larvas se entierran en las raíces de estas plantas, causando daño que resulta en crecimiento atrofiado, decoloración y mayor susceptibilidad a infecciones secundarias.",
        "symptoms": "Túneles de color óxido en las raíces, amarillamiento y marchitamiento del follaje, y agrietamiento de las raíces. Las plantas severamente infestadas pueden pudrirse y fallar en prosperar.",
        "treatment": "Usa malla fina para cubrir las plantas y prevenir que las moscas adultas pongan huevos. Practica la rotación de cultivos para interrumpir el ciclo de vida de la plaga. Retira y destruye las plantas infestadas inmediatamente para prevenir la propagación de las larvas. La siembra compañera con plantas de olor fuerte como cebollas o ajo también puede disuadir a las moscas de la zanahoria.",
        "photo": "https://www.azamsharp.com/images/carrotfly.png"
      },
      {
        "name": "Pulgones",
        "description": "Los pulgones son insectos pequeños de cuerpo blando que pueden variar en color, incluyendo verde, amarillo, marrón, rojo o negro. Se alimentan de la savia de las plantas perforando hojas y tallos con sus partes bucales. Los pulgones son una plaga común en jardines y granjas, a menudo formando grandes colonias en el nuevo crecimiento.",
        "symptoms": "Las plantas infestadas pueden mostrar hojas curvadas o amarillentas, crecimiento atrofiado y residuo pegajoso de melaza en el follaje. La melaza puede atraer hormigas y llevar al desarrollo de moho negro en las superficies de las plantas.",
        "treatment": "Introduce depredadores naturales como mariquitas y crisopas para controlar las poblaciones de pulgones. Rocía las plantas con un chorro fuerte de agua para desalojar los insectos. Aplica aceite de neem o jabón insecticida para manejo orgánico de plagas. Retira y destruye las partes severamente infestadas de la planta para prevenir mayor propagación.",
        "photo": "https://www.azamsharp.com/images/aphids.png"
      }
    ]
  },
  {
    "VegetableId": 7,
    "VegetableCode": "002",
    "CatalogId": 2,
    "Name": "Chile Picante",
    "Description": "Una verdura vibrante y ardiente que añade picante a cualquier plato. Los chiles picantes son apreciados por sus niveles de calor, que van desde suave hasta extremo, y son ricos en vitamina C y capsaicina.",
    "ThumbnailImage": "https://www.azamsharp.com/images/pepper.png",
    "SeedDepth": "1/4 \" (6 mm)",
    "GerminationSoilTemp": "80-85 F (27-29 C)",
    "DaysToGermination": 7,
    "SowIndoors": "8 semanas antes de la helada",
    "SowOutdoors": "No recomendado",
    "PhRange": "5.5 - 7.0",
    "GrowingSoilTemp": "70 - 85 F (21-29 C)",
    "SpacingBeds": "12\" (30 cm)",
    "Watering": "Moderado y uniforme",
    "Light": "Sol completo",
    "GoodCompanions": "Zanahoria, cebolla, chirivía, guisante",
    "BadCompanions": "Hinojo, colinabo",
    "SowingDescription": "Al plantar pimientos asegúrate de que todos los peligros de helada hayan pasado. Si hay implicaciones de helada entonces puedes comenzar en interiores. \r",
    "GrowingDescription": "Asegúrate de que el suelo esté uniformemente húmedo. Las plantas de pimiento requieren al menos 1.5 pulgadas de agua a la semana. Puedes conservar la humedad poniendo mantillo en la parte superior del suelo.",
    "HarvestDescription": "Cuando el pimiento haya crecido a un tamaño grande entonces es tiempo de cosechar. Mientras más coseches, más pimientos serán producidos por las plantas.",
    "Active": null,
    "Season": "Verano",
    "DaysToHarvestSeeds": 85,
    "DaysToHarvestSeedlings": 64,
    "HealthBenefits": "Los chiles picantes contienen capsaicina, que puede reducir el dolor, mejorar la digestión y acelerar el metabolismo.",
    "Pests": [
      {
        "name": "Gorgojo del Pimiento",
        "description": "El gorgojo del pimiento (Anthonomus eugenii) es un escarabajo pequeño de color oscuro con cuerpo ovalado y hocico prominente. Es una plaga significativa de pimientos y otras plantas de la familia Solanaceae, causando daño a flores y frutos. Los escarabajos adultos se alimentan de tejidos vegetales, mientras que las larvas se desarrollan dentro del fruto, llevando a pérdidas significativas de cultivos.",
        "symptoms": "Caída prematura de capullos florales y frutos, amarillamiento de tallos y cáliz, y cicatrices de alimentación o perforaciones en los frutos. Los frutos infestados pueden contener larvas y mostrar pardeamiento interno o pudrición.",
        "treatment": "El manejo efectivo incluye monitoreo regular y remoción de frutos y plantas infestadas. Usa trampas de feromonas para monitorear y reducir las poblaciones adultas. Practica la rotación de cultivos para minimizar los gorgojos que hibernan. Aplica insecticidas etiquetados para control de gorgojo del pimiento cuando sea necesario, y considera agentes de control biológico como la avispa parasitoide Catolaccus hunteri.",
        "photo": "https://www.azamsharp.com/images/pepper_weevil.png"
      },
      {
        "name": "Trips",
        "description": "Los trips son insectos diminutos y delgados que se alimentan de plantas perforando sus superficies y succionando el contenido de las células. Son conocidos por atacar una amplia variedad de plantas, incluyendo verduras, frutas y plantas ornamentales. Los trips también pueden transmitir virus de plantas, haciéndolos plagas particularmente dañinas.",
        "symptoms": "Las plantas infestadas pueden mostrar decoloración plateada o punteada en las hojas, crecimiento distorsionado y manchas fecales negras en el follaje. Las flores pueden aparecer deformadas, y los frutos pueden desarrollar cicatrices o volverse deformes.",
        "treatment": "Introduce depredadores naturales como crisopas y chinches piratas diminutos para controlar las poblaciones de trips. Usa jabones insecticidas o aceite de neem para manejo orgánico de plagas. Las trampas pegajosas pueden ayudar a monitorear y reducir las poblaciones adultas. Retira y destruye las plantas severamente infestadas para prevenir la propagación de trips y virus de plantas asociados.",
        "photo": "https://www.azamsharp.com/images/thrips.png"
      }
    ]
  },
  {
    "VegetableId": 8,
    "VegetableCode": "003",
    "CatalogId": 2,
    "Name": "Ejotes Verdes",
    "Description": "Un favorito del jardín y segundo solo después de los tomates en popularidad. Los ejotes verdes son crujientes, tiernos y llenos de fibra y vitaminas esenciales, perfectos para salteados o como guarnición.",
    "ThumbnailImage": "https://www.azamsharp.com/images/greenbeans.png",
    "SeedDepth": "1\" (2.5 cm)",
    "GerminationSoilTemp": "40-75 F (4-24 C)",
    "DaysToGermination": 14,
    "SowIndoors": "No recomendado",
    "SowOutdoors": "Finales de verano",
    "PhRange": "6.0-7.0",
    "GrowingSoilTemp": "60-65 F (16-18 C)",
    "SpacingBeds": "1\" (2.5 cm)",
    "Watering": "Moderado luego bajo",
    "Light": "Sol completo",
    "GoodCompanions": "Zanahoria, apio, achicoria, maíz, pepino, berenjena, perejil, papa temprana, rábano, espinaca, nabo",
    "BadCompanions": "Cebolla, papa tardía",
    "SowingDescription": "Primero asegúrate de que no haya peligro de helada. La helada puede matar fácilmente los ejotes verdes. Entierra 4-6 semillas a 2 pulgadas de profundidad una de otra en hileras. Cubre cada semilla con tierra y luego riégalas. Cuando plantes ejotes verdes, quieres regarlos de inmediato.",
    "GrowingDescription": "Asegúrate de que el área esté limpia y no haya malezas creciendo. Las malezas pueden robar todos los nutrientes de los ejotes verdes y esto puede resultar en la muerte de la planta de ejotes verdes. Riega tus ejotes verdes todos los días. También puedes incluir una capa de mantillo para ayudar a controlar las malezas y asegurar que el suelo esté húmedo. \r",
    "HarvestDescription": "Puedes comenzar a cosechar ejotes verdes cuando estén largos y firmes. Mientras más ejotes verdes recojas, más producirá.",
    "Active": null,
    "Season": "Verano",
    "DaysToHarvestSeeds": 50,
    "DaysToHarvestSeedlings": 35,
    "HealthBenefits": "Llenos de fibra y vitaminas, los ejotes verdes apoyan la digestión y la salud inmune en general.",
    "Pests": [
      {
        "name": "Escarabajo del Frijol",
        "description": "El escarabajo del frijol, también conocido como gorgojo del caupí (Callosobruchus maculatus), es un escarabajo pequeño de forma ovalada que afecta principalmente a legumbres como frijoles, lentejas y caupíes. Los escarabajos adultos ponen sus huevos en los frijoles, y las larvas se entierran en las semillas, causando daño significativo.",
        "symptoms": "Frijoles ahuecados o dañados con pequeños agujeros de salida. Las semillas infestadas pueden tener larvas alimentándose adentro, lo que reduce la germinación y la calidad de la semilla. Los escarabajos adultos a menudo se ven cerca de legumbres almacenadas.",
        "treatment": "Para manejar las infestaciones de escarabajo del frijol, almacena los frijoles en contenedores herméticos o en el congelador para matar huevos y larvas. Inspecciona y limpia las áreas de almacenamiento regularmente para eliminar posibles infestaciones. Para infestaciones a gran escala, considera usar agentes de control biológico como avispas parasíticas o aplicar insecticidas seguros para alimentos.",
        "photo": "https://www.azamsharp.com/images/bean_beetle.png"
      },
      {
        "name": "Ácaros Araña",
        "description": "Los ácaros araña son arácnidos diminutos, a menudo menos de 1 mm de tamaño, que se alimentan de la savia de las plantas. Prosperan en condiciones calientes y secas, causando daño significativo a una amplia variedad de plantas, incluyendo verduras, frutas y ornamentales. Los ácaros araña son conocidos por crear telarañas finas en las superficies de las plantas.",
        "symptoms": "Las plantas infestadas pueden exhibir hojas punteadas o amarillentas, con una apariencia bronceada o polvorienta. Las infestaciones severas resultan en caída de hojas y telarañas finas en la parte inferior de las hojas o entre los tallos de las plantas. Las plantas pueden aparecer débiles o atrofiadas.",
        "treatment": "Para manejar las infestaciones de ácaros araña, rocía las plantas con un chorro fuerte de agua para desalojar los ácaros. Introduce depredadores naturales como mariquitas o ácaros depredadores. Usa aceites hortícolas, jabones insecticidas o aceite de neem para controlar las poblaciones. Mantén las plantas bien regadas y húmedas para reducir la probabilidad de infestación.",
        "photo": "https://www.azamsharp.com/images/spider_mites.png"
      }
    ]
  },
  {
    "VegetableId": 9,
    "VegetableCode": "004",
    "CatalogId": 2,
    "Name": "Cebolla",
    "Description": "Un básico de cocina con sabor fuerte y sabroso. Las cebollas son versátiles y esenciales en innumerables recetas, desde sopas y guisos hasta ensaladas y salteados.",
    "ThumbnailImage": "https://www.azamsharp.com/images/onions.png",
    "SeedDepth": "1/4\"-1/2\" (.65 - 1.3 cm)",
    "GerminationSoilTemp": "65-85F (18-29 C)",
    "DaysToGermination": 5,
    "SowIndoors": "2 meses antes de la helada",
    "SowOutdoors": "Primavera",
    "PhRange": "6.0-7.5",
    "GrowingSoilTemp": "55-75 F (13-24 C)",
    "SpacingBeds": "3-4\" (7.5 - 10 cm)",
    "Watering": "Medio y uniforme",
    "Light": "Sol completo",
    "GoodCompanions": "Remolacha, familia de la col, zanahoria, espinaca",
    "BadCompanions": "Espárrago, frijol, guisante",
    "SowingDescription": "Las cebollas deben plantarse a pleno sol. Asegúrate de aflojar el suelo y quitar todas las piedras. Trabaja duro para hacer el suelo firme. Hacer el suelo firme y suelto permitirá que las cebollas crezcan mucho mejor.",
    "GrowingDescription": "Al elegir el conjunto de cebollas asegúrate de que las cebollas estén firmes y regordetas. Cava un pequeño hoyo solo lo suficiente para que la punta de la cebolla esté expuesta afuera.",
    "HarvestDescription": "Cosecha las cebollas a finales de primavera.",
    "Active": null,
    "Season": "Primavera,Otoño,Verano,Invierno",
    "DaysToHarvestSeeds": 139,
    "DaysToHarvestSeedlings": 60,
    "HealthBenefits": "Las cebollas son ricas en antioxidantes y compuestos que combaten la inflamación y fortalecen la salud del corazón.",
    "Pests": [
      {
        "name": "Mosca de la Cebolla",
        "description": "La mosca de la cebolla (Delia antiqua) es una mosca pequeña y grisácea que se parece a una mosca doméstica. Es una plaga significativa para cebollas, ajo, puerros y otros alliums. Las larvas, también conocidas como gusanos, se alimentan de los bulbos y raíces de estas plantas, causando daño extenso y reduciendo el rendimiento de los cultivos.",
        "symptoms": "Las plantas infestadas pueden mostrar amarillamiento y marchitamiento de las hojas, crecimiento atrofiado y bulbos en putrefacción. La presencia de gusanos en el bulbo o raíces es una señal clara de infestación.",
        "treatment": "Previene las infestaciones de mosca de la cebolla usando rotación de cultivos y evitando plantar alliums en la misma ubicación consecutivamente. Cubre los cultivos con malla fina para prevenir la puesta de huevos. Retira y destruye las plantas infestadas inmediatamente. Los nematodos beneficiosos pueden aplicarse al suelo para atacar las larvas. Los insecticidas químicos pueden usarse como último recurso siguiendo las instrucciones de la etiqueta.",
        "photo": "https://www.azamsharp.com/images/onion_fly.png"
      },
      {
        "name": "Trips",
        "description": "Los trips son insectos diminutos y delgados que se alimentan de células vegetales perforando hojas, flores y frutos y succionando el contenido. Son plagas comunes que afectan una amplia gama de cultivos, incluyendo verduras, frutas y plantas ornamentales. Los trips también son conocidos por propagar virus de plantas, haciéndolos una preocupación agrícola seria.",
        "symptoms": "Las plantas afectadas pueden exhibir decoloración plateada o punteada en las hojas, crecimiento distorsionado o deformado, y manchas fecales oscuras en el follaje. En infestaciones severas, las flores y frutos pueden aparecer cicatrizados o dañados, y el vigor de la planta puede declinar.",
        "treatment": "Controla los trips introduciendo depredadores naturales como crisopas y chinches piratas diminutos. Usa trampas pegajosas para monitorear y reducir las poblaciones adultas. Aplica jabones insecticidas o aceite de neem para control orgánico de plagas. Poda y destruye las partes severamente infestadas de la planta. Mantén higiene adecuada de las plantas y evita fertilización excesiva con nitrógeno, que puede atraer trips.",
        "photo": "https://www.azamsharp.com/images/thrips.png"
      }
    ]
  },
  {
    "VegetableId": 10,
    "VegetableCode": "005",
    "CatalogId": 2,
    "Name": "Tomate",
    "Description": "Una fruta jugosa y sabrosa a menudo confundida con una verdura, los tomates vienen en muchas variedades y colores. Son ricos en licopeno, un antioxidante, y añaden sabor vibrante a ensaladas, salsas y más.",
    "ThumbnailImage": "https://www.azamsharp.com/images/tomato.png",
    "SeedDepth": "1/2\" (13 mm)",
    "GerminationSoilTemp": "80 F (27 C)",
    "DaysToGermination": 7,
    "SowIndoors": "7 semanas antes de la helada",
    "SowOutdoors": "cuando el peligro de helada haya pasado",
    "PhRange": "5.8-7.0",
    "GrowingSoilTemp": "70F (21 C)",
    "SpacingBeds": "15\" (37.5 cm)",
    "Watering": "Moderado a alto durante el crecimiento, bajo durante la cosecha",
    "Light": "Sol completo",
    "GoodCompanions": "Albahaca, frijol arbustivo, pepino",
    "BadCompanions": "Frijol trepador, eneldo, hinojo, papa",
    "SowingDescription": "Corta el tomate por la mitad y saca las semillas. Coloca las semillas en el recipiente y pon el doble de agua que semillas tienes. Enjuaga las semillas y asegúrate de que toda la pulpa sea removida. Una vez removida, las semillas están listas para plantar.\r",
    "GrowingDescription": "Coloca las macetas en un lugar cálido y soleado. Cuando las plantas hayan crecido varias pulgadas de altura y tengan al menos 3 hojas en cada planta, están listas para trasplantar. Cava un pequeño hoyo en el suelo y pon la planta en ese hoyo. Asegúrate de que solo 1/4 de la planta sobresalga del suelo. Inmediatamente vierte agua en el hoyo. \r",
    "HarvestDescription": "Cuando la fruta se vuelva roja (o cualquier color que hayas plantado), recoge y disfruta los frutos de tu trabajo. Cuando lo hagas, sabrás que valió la pena.",
    "Active": null,
    "Season": "Verano",
    "DaysToHarvestSeeds": 80,
    "DaysToHarvestSeedlings": 60,
    "HealthBenefits": "Rico en licopeno, los tomates promueven la salud del corazón, reducen la inflamación y apoyan la salud de la piel.",
    "Pests": [
      {
        "name": "Gusano Cuerno del Tomate",
        "description": "El gusano cuerno del tomate (Manduca quinquemaculata) es una oruga grande y verde con marcas blancas en forma de V y una proyección prominente parecida a un cuerno en su parte trasera. Es una plaga destructiva que se alimenta de las hojas, tallos y frutos de plantas de la familia de las solanáceas, incluyendo tomates, pimientos y berenjenas.",
        "symptoms": "Las plantas infestadas pueden tener tallos defoliados, hojas masticadas o faltantes, y orugas visibles. Los excrementos verde oscuro o negro (frass) en el follaje son una señal común de actividad del gusano cuerno del tomate.",
        "treatment": "Recoge a mano los gusanos cuerno de las plantas y échalos en agua jabonosa para infestaciones a pequeña escala. Introduce depredadores naturales como avispas parasíticas o pájaros para controlar las poblaciones. Aplica Bacillus thuringiensis (Bt) o insecticidas a base de spinosad para manejo orgánico. Mantén un jardín limpio removiendo malezas y desechos que puedan albergar gusanos cuerno.",
        "photo": "https://www.azamsharp.com/images/tomato_hornworm.png"
      },
      {
        "name": "Mosca Blanca",
        "description": "Las moscas blancas son insectos pequeños y alados que se parecen a pequeñas polillas blancas. Son plagas chupadoras de savia que atacan una amplia variedad de plantas, incluyendo verduras, frutas y ornamentales. Las moscas blancas se congregan en la parte inferior de las hojas y son conocidas por transmitir enfermedades de plantas, dañando aún más los cultivos.",
        "symptoms": "Las plantas infestadas pueden exhibir amarillamiento, marchitamiento o crecimiento atrofiado. La parte inferior de las hojas puede tener racimos de pequeños insectos blancos. Una sustancia pegajosa llamada melaza está a menudo presente, lo que puede llevar al desarrollo de moho negro.",
        "treatment": "Introduce depredadores naturales como mariquitas y crisopas para controlar las poblaciones de moscas blancas. Usa trampas pegajosas amarillas para monitorear y reducir sus números. Aplica aceite de neem, jabones insecticidas o aceites hortícolas para control orgánico. Retira las hojas severamente infestadas y mantén higiene adecuada de las plantas para prevenir infestaciones.",
        "photo": "https://www.azamsharp.com/images/whitefly.png"
      }
    ]
  },
  {
    "VegetableId": 11,
    "VegetableCode": "006",
    "CatalogId": 2,
    "Name": "Rábano",
    "Description": "Los rábanos (Raphanus sativus) son verduras de raíz crujientes conocidas por su sabor picante y colores vibrantes, que van desde rojo y rosa hasta blanco y morado. Comúnmente usados en ensaladas, coleslaws y como guarniciones, los rábanos añaden un crujido refrescante a los platos. Son bajos en calorías y altos en vitamina C, apoyando la inmunidad y promoviendo la digestión saludable. Los rábanos crecen rápidamente y prosperan en clima frío, haciéndolos una opción popular para jardines caseros.",
    "ThumbnailImage": "https://www.azamsharp.com/images/radish.png",
    "SeedDepth": "1/2\" (13 mm)",
    "GerminationSoilTemp": "45 - 90 F (7-32 C)",
    "DaysToGermination": 10,
    "SowIndoors": "No recomendado",
    "SowOutdoors": "Principios de primavera y otoño",
    "PhRange": "6.0-7.0",
    "GrowingSoilTemp": "60-65F (16-18 C)",
    "SpacingBeds": "1\" (2.5 cm)",
    "Watering": "Uniforme y moderado",
    "Light": "Sol completo",
    "GoodCompanions": "Frijol, remolacha, zanahoria",
    "BadCompanions": "Hinojo",
    "SowingDescription": "Hay muchos tipos diferentes de rábanos que se pueden plantar. El más fácil de cultivar es llamado Cherry Belle, maduran en solo 22 días. Los rábanos deben plantarse a pleno sol o sombra parcial con suelo bien drenado. Añade compost al suelo para acelerar el proceso. \r",
    "GrowingDescription": "Riega los rábanos diariamente mientras están creciendo. El crecimiento rápido de los rábanos depende del riego uniforme.",
    "HarvestDescription": "Los rábanos están listos para cosechar cuando sus raíces tienen aproximadamente 1 pulgada (2.5 cm) de diámetro. Para cosechar simplemente tira la planta del suelo. \r",
    "Active": null,
    "Season": "Primavera,Verano",
    "DaysToHarvestSeeds": 25,
    "DaysToHarvestSeedlings": 14,
    "HealthBenefits": "Los rábanos son bajos en calorías y altos en fibra, promoviendo la digestión e hidratación.",
    "Pests": [
      {
        "name": "Gusanos de la Raíz",
        "description": "Los gusanos de la raíz son las larvas de varias especies de moscas, incluyendo moscas de la col y moscas de la cebolla. Estos gusanos diminutos de color crema se alimentan de las raíces de las plantas, particularmente verduras crucíferas como col, rábanos y nabos. Su alimentación debilita la planta, haciéndola susceptible a enfermedades y reduciendo el rendimiento del cultivo.",
        "symptoms": "Las plantas infestadas con gusanos de la raíz pueden mostrar signos de marchitamiento, hojas amarillentas, crecimiento atrofiado y vigor pobre. Cuando las raíces son inspeccionadas, a menudo tienen pequeños agujeros, túneles y evidencia de alimentación larval. Las raíces infestadas pueden pudrirse con el tiempo.",
        "treatment": "Previene las infestaciones de gusanos de la raíz usando cubiertas de hileras para excluir moscas adultas de poner huevos cerca de las plantas. Practica rotación de cultivos para interrumpir el ciclo de vida de los gusanos. Aplica nematodos beneficiosos al suelo para atacar las larvas. Retira y destruye las plantas severamente infestadas y desinfecta las herramientas de jardín para prevenir la propagación. La tierra de diatomeas también puede espolvorearse alrededor de las bases de las plantas para disuadir la puesta de huevos.",
        "photo": "https://www.azamsharp.com/images/root_maggots.png"
      },
      {
        "name": "Gusanos de la Col",
        "description": "Los gusanos de la col son las larvas de la mosca de la col (Delia radicum), que afectan principalmente verduras crucíferas como col, brócoli, coliflor y rábanos. Los pequeños gusanos blancos se entierran en las raíces, causando daño significativo al sistema radicular de la planta y llevando a crecimiento reducido y rendimiento.",
        "symptoms": "Las plantas infestadas pueden marchitarse, amarillear y mostrar crecimiento atrofiado. Al inspeccionar las raíces, puedes encontrar pequeños agujeros, túneles y pudrición causados por la alimentación de los gusanos. Las plantas severamente dañadas pueden morir.",
        "treatment": "Previene las infestaciones de gusanos de la col usando cubiertas flotantes de hileras para excluir moscas de poner huevos. Practica rotación de cultivos para evitar infestaciones repetidas en la misma área. Aplica nematodos beneficiosos al suelo para atacar las larvas. Amontona tierra alrededor de la base de la planta para disuadir la puesta de huevos. Retira y destruye las plantas infestadas para reducir la propagación.",
        "photo": "https://www.azamsharp.com/images/cabbage_maggots.png"
      }
    ]
  },
  {
    "VegetableId": 13,
    "VegetableCode": "007",
    "CatalogId": 13,
    "Name": "Rúcula",
    "Description": "La rúcula (Eruca vesicaria), también conocida como rocket, es una verdura de hoja verde con un sabor picante distintivo. A menudo usada en ensaladas, sándwiches y como cobertura para pizzas, la rúcula añade un mordisco picante y refrescante a los platos. Es rica en vitaminas A, C y K, así como en antioxidantes, apoyando la salud ósea, inmunidad y bienestar general. La rúcula prospera en climas fríos y es un cultivo de crecimiento rápido, haciéndola una favorita entre los jardineros caseros.",
    "ThumbnailImage": "https://www.azamsharp.com/images/arugula.png",
    "SeedDepth": "1/4\" (6 mm)",
    "GerminationSoilTemp": "40-55F (4-13 C)",
    "DaysToGermination": 6,
    "SowIndoors": "Finales de otoño, principios de primavera",
    "SowOutdoors": "En suelo trabajado",
    "PhRange": "6.0-7.0",
    "GrowingSoilTemp": "50-65F (10-18 C)",
    "SpacingBeds": "1\" (2.5 cm)",
    "Watering": "Moderado y uniforme",
    "Light": "Sol completo",
    "GoodCompanions": "Frijol arbustivo, remolacha, zanahoria, apio, pepino",
    "BadCompanions": "Ejotes verdes, fresa",
    "SowingDescription": "Prepara el suelo vertiendo el compost en las 3 pulgadas superiores (8 cm) del suelo. Las semillas pueden plantarse en primavera tan pronto como el suelo pueda trabajarse. Puedes plantar semillas adicionales cada 3 semanas mientras dure el clima frío.",
    "GrowingDescription": "Por favor lee la sección sobre siembra.",
    "HarvestDescription": "Cosecha las hojas cuando tengan 2 a 3 pulgadas de largo. Esto se logrará en 2 o 3 semanas después de que las plantas germinen. Asegúrate de cortar hojas individuales o toda la planta. También puedes usar las flores en tu ensalada.",
    "Active": null,
    "Season": "Primavera,Otoño",
    "DaysToHarvestSeeds": 45,
    "DaysToHarvestSeedlings": 60,
    "HealthBenefits": "Rica en antioxidantes y vitaminas, la rúcula apoya la salud ósea y fortalece la inmunidad.",
    "Pests": [
      {
        "name": "Escarabajos Pulga",
        "description": "Los escarabajos pulga son escarabajos pequeños y saltarines que atacan una amplia variedad de plantas, incluyendo verduras como col, berenjenas y tomates. Son nombrados por su habilidad de saltar como pulgas cuando son molestados. Estas plagas son conocidas por masticar pequeños agujeros en las hojas, dándoles una apariencia de 'agujero de disparo'.",
        "symptoms": "Las plantas infestadas con escarabajos pulga exhiben pequeños agujeros redondos en las hojas, a menudo pareciendo daño de escopeta. Las plántulas y plantas jóvenes son especialmente vulnerables y pueden marchitarse, volverse atrofiadas o incluso morir bajo infestaciones severas.",
        "treatment": "Usa cubiertas flotantes de hileras para proteger plantas jóvenes de escarabajos pulga. Aplica tierra de diatomeas o aceite de neem para disuadirlos. Planta cultivos trampa como rábanos para atraer escarabajos lejos de los cultivos principales. Introducir depredadores naturales, como nematodos, y practicar rotación de cultivos puede ayudar a manejar las poblaciones.",
        "photo": "https://www.azamsharp.com/images/flea_beetles.png"
      },
      {
        "name": "Gusanos de la Col",
        "description": "Los gusanos de la col son las larvas de la pequeña mariposa blanca (Pieris rapae), que son plagas comunes de verduras crucíferas como col, brócoli y col rizada. Estas orugas verdes tienen una textura aterciopelada y son comedores voraces que pueden causar daño significativo a las plantas.",
        "symptoms": "Las plantas infestadas exhiben agujeros en las hojas, bordes masticados y frass (excrementos de oruga) en el follaje. Las infestaciones pesadas pueden llevar a defoliación, crecimiento reducido y cultivos de mala calidad.",
        "treatment": "Recoge a mano los gusanos de la col de las plantas y deséchalos para controlar infestaciones pequeñas. Usa cubiertas flotantes de hileras para prevenir que las mariposas pongan huevos. Aplica Bacillus thuringiensis (Bt) o insecticidas a base de spinosad para control orgánico. Fomenta depredadores naturales como pájaros o avispas parasíticas en el jardín.",
        "photo": "https://www.azamsharp.com/images/cabbage_worms.png"
      }
    ]
  },
  {
    "VegetableId": 14,
    "VegetableCode": "008",
    "CatalogId": 7,
    "Name": "Maíz",
    "Description": "El maíz (Zea mays), también conocido como maíz, es un cultivo de cereal versátil y ampliamente cultivado conocido por sus granos dulces y tiernos. Puede disfrutarse fresco, asado, hervido o añadido a sopas, ensaladas y guisos. Rico en fibra, vitaminas B y C, y antioxidantes como luteína, el maíz apoya la digestión saludable, fortalece la inmunidad y promueve la salud ocular. Prosperando en climas cálidos y soleados, el maíz es un alimento básico en dietas mundiales y un cultivo favorito entre jardineros por su alto rendimiento y adaptabilidad.",
    "ThumbnailImage": "https://www.azamsharp.com/images/corn.png",
    "SeedDepth": "1\" (2.5 cm)",
    "GerminationSoilTemp": "80F (27 C)",
    "DaysToGermination": 4,
    "SowIndoors": "No recomendado",
    "SowOutdoors": "1 semana después de la última helada",
    "PhRange": "6.0-7.0",
    "GrowingSoilTemp": "65-75 F (18-24 C)",
    "SpacingBeds": "8\" (20 cm)",
    "Watering": "Moderado a pesado",
    "Light": "Sol completo",
    "GoodCompanions": "Frijol arbustivo, remolacha, col, pepino, guisante, calabaza",
    "BadCompanions": "Tomate",
    "SowingDescription": "Retira el mantillo para permitir que el suelo comience a calentarse y añade un poco de compost terminado al suelo. Para calentar aún más el suelo puedes cubrir el suelo con un plástico negro. Las semillas deben sembrarse 1 pulgada de profundidad y 8 pulgadas de distancia. \r",
    "GrowingDescription": "Espacía las semillas y hileras correctamente. El espaciado entre hileras debe ser de 36\", y el espaciado de semillas por hilera también debe ser de 36\". El espaciado es crítico porque el maíz necesita otras plantas para polinizar para producir mazorcas de maíz. El maíz necesita al menos 4 a 6 hileras para buena polinización; 8 a 12 hileras es mejor, incluso en un jardín casero, si es posible.\r",
    "HarvestDescription": "Toca los granos en las mazorcas después de 3 semanas. Deben estar llenos de líquido lechoso. Presiona el grano y el líquido brotará. Esta es la señal de que el maíz está listo para cosechar.",
    "Active": null,
    "Season": "Verano,Primavera",
    "DaysToHarvestSeeds": 89,
    "DaysToHarvestSeedlings": 70,
    "HealthBenefits": "El maíz proporciona energía, es rico en antioxidantes y apoya la visión saludable con su contenido de luteína.",
    "Pests": [
      {
        "name": "Gusano de la Mazorca",
        "description": "El gusano de la mazorca (Helicoverpa zea) es una larva de polilla que es una plaga común del maíz y otros cultivos, incluyendo tomates, pimientos y frijoles. Las orugas varían en color de verde a marrón y pueden crecer hasta 2 pulgadas de largo. Son conocidos por enterrarse en las mazorcas de maíz y alimentarse de los granos.",
        "symptoms": "Las mazorcas de maíz infestadas pueden tener granos masticados, daño en la seda y presencia de frass (excrementos de oruga). Las orugas también pueden causar daño a las puntas de las mazorcas, llevando a cosechas de mala calidad.",
        "treatment": "Planta variedades de maíz resistentes y aplica Bacillus thuringiensis (Bt) para controlar las larvas. Usa aerosoles insecticidas dirigidos a las etapas tempranas del desarrollo larval. Fomenta depredadores naturales como pájaros y avispas parasíticas. Asegura rotación adecuada de cultivos para interrumpir el ciclo de vida de la plaga.",
        "photo": "https://www.azamsharp.com/images/corn_earworm.png"
      },
      {
        "name": "Gusanos Soldado",
        "description": "Los gusanos soldado son las larvas de polillas pertenecientes al género Spodoptera. Son nombrados por su comportamiento de moverse en grandes grupos a través de campos, consumiendo cultivos en su camino. Estas plagas atacan una amplia variedad de cultivos, incluyendo granos, maíz, verduras y pastos. Las orugas son verdosas a marrones con rayas y pueden crecer hasta 2 pulgadas de largo.",
        "symptoms": "Las plantas infestadas muestran signos de hojas masticadas, follaje esqueletizado y tallos dañados. Las infestaciones grandes pueden llevar a defoliación y pérdidas significativas de cultivos. Los gusanos soldado a menudo crean parches de vegetación destruida mientras se mueven a través de los campos.",
        "treatment": "Monitorea los campos regularmente y recoge a mano gusanos soldado donde sea posible. Aplica Bacillus thuringiensis (Bt) o insecticidas a base de spinosad para control orgánico. Usa trampas de feromonas para monitorear la actividad de polillas e interrumpir su reproducción. Fomenta depredadores naturales como pájaros, avispas parasíticas y escarabajos del suelo para reducir las poblaciones.",
        "photo": "https://www.azamsharp.com/images/armyworms.png"
      }
    ]
  },
  {
    "VegetableId": 15,
    "VegetableCode": "009",
    "CatalogId": 13,
    "Name": "Remolacha",
    "Description": "Las remolachas (Beta vulgaris) son verduras de raíz ricas en nutrientes apreciadas por su sabor dulce y terroso y color rojo o dorado vibrante. Pueden disfrutarse asadas, hervidas, encurtidas o crudas en ensaladas y jugos. Las remolachas son una rica fuente de fibra dietética, folato y nitratos, que apoyan la salud del corazón, mejoran el flujo sanguíneo y aumentan la resistencia. Las hojas verdes también son comestibles y están llenas de vitaminas A y K. Las remolachas prosperan en climas fríos y son un cultivo versátil para jardines caseros.",
    "ThumbnailImage": "https://www.azamsharp.com/images/beet.png",
    "SeedDepth": "1/2\" (13 mm)",
    "GerminationSoilTemp": "75-85 F (24-29 C)",
    "DaysToGermination": 5,
    "SowIndoors": "5 semanas antes de la helada",
    "SowOutdoors": "4 semanas antes de la helada",
    "PhRange": "6.5-7.5",
    "GrowingSoilTemp": "65-75 F (18-24 C)",
    "SpacingBeds": "2\" (5 cm)",
    "Watering": "Moderado y uniforme",
    "Light": "Sol completo",
    "GoodCompanions": "Frijol arbustivo, maíz, puerro, lechuga",
    "BadCompanions": "Ejotes verdes, mostaza",
    "SowingDescription": "Las remolachas son una verdura de clima frío por lo tanto deben plantarse cuando el clima es frío. Al cultivar remolachas, asegúrate de plantar las semillas una a dos pulgadas de distancia en la hilera. Puedes cubrir las semillas ligeramente con tierra suelta, y luego rociarlas con agua. Debes ver las plantas comenzar a crecer en siete a 14 días. Si quieres un suministro continuo, planta tus remolachas en varias siembras, aproximadamente tres semanas de distancia una de otra.\r",
    "GrowingDescription": "Incluye remolachas junto con cebollas, lechuga, col, brócoli y frijoles arbustivos en tu jardín. Todas estas son verduras de clima frío. Riega bien las plántulas. Mantén las remolachas regadas mientras crecen. Mantén toda la hierba limpia del parche de remolachas con una azada de jardín.\r",
    "HarvestDescription": "Cosecha las remolachas cuando tengan de 1 a 3 pulgadas (1.5 a 4.5 cm) de diámetro. Tira las remolachas suavemente del suelo. Si prefieres comer las hojas de remolacha, querrás cosechar las hojas cuando las remolachas sean mucho más jóvenes, para que las hojas sean tiernas.\r",
    "Active": null,
    "Season": "Primavera,Verano",
    "DaysToHarvestSeeds": 60,
    "DaysToHarvestSeedlings": 40,
    "HealthBenefits": "Las remolachas son altas en nitratos, que pueden mejorar el flujo sanguíneo y reducir la presión arterial.",
    "Pests": [
      {
        "name": "Minadores de Hoja",
        "description": "Los minadores de hoja son las larvas de varias especies de insectos, incluyendo moscas, escarabajos y polillas, que se alimentan del tejido entre las superficies superior e inferior de las hojas. Crean túneles distintivos y serpenteantes o manchas mientras se mueven a través de la hoja. Los minadores de hoja son plagas comunes de verduras, plantas ornamentales y árboles frutales.",
        "symptoms": "Las hojas infestadas exhiben senderos serpenteantes, blancos o translúcidos (minas) que a menudo se vuelven marrones con el tiempo. Las hojas pueden volverse decoloradas, distorsionadas o caer prematuramente, reduciendo el vigor de la planta y la capacidad fotosintética.",
        "treatment": "Poda y destruye las hojas infestadas para prevenir que las larvas maduren. Aplica aceite de neem o jabón insecticida para disuadir a los minadores de hoja adultos de poner huevos. Introduce depredadores naturales, como avispas parasíticas, para controlar las poblaciones. Usa cubiertas flotantes de hileras para proteger los cultivos de insectos adultos.",
        "photo": "https://www.azamsharp.com/images/leaf_miners.png"
      },
      {
        "name": "Gusanos Soldado de la Remolacha",
        "description": "Los gusanos soldado de la remolacha (Spodoptera exigua) son las larvas de polillas que atacan una amplia gama de cultivos, incluyendo remolachas, tomates, pimientos y lechuga. Estas orugas son verde claro a negro con rayas pálidas corriendo a lo largo de sus cuerpos. Los gusanos soldado de la remolacha son altamente destructivos, alimentándose de hojas, tallos y frutos de las plantas.",
        "symptoms": "Las plantas infestadas exhiben hojas esqueletizadas, follaje masticado y daño a tallos o frutos. Las infestaciones severas pueden resultar en defoliación y rendimientos reducidos de cultivos. Los grupos de huevos cubiertos en material algodonoso a menudo se encuentran en la parte inferior de las hojas.",
        "treatment": "Monitorea las plantas regularmente y retira grupos de huevos y larvas a mano. Aplica Bacillus thuringiensis (Bt) o insecticidas a base de spinosad para control orgánico. Usa trampas de feromonas para monitorear y reducir las poblaciones de polillas adultas. Fomenta depredadores naturales, como avispas parasíticas y pájaros, para ayudar a controlar las infestaciones.",
        "photo": "https://www.azamsharp.com/images/beet_armyworms.png"
      }
    ]
  },
  {
    "VegetableId": 16,
    "VegetableCode": "010",
    "CatalogId": 2,
    "Name": "Pepino",
    "Description": "Los pepinos (Cucumis sativus) son verduras refrescantes y crujientes con sabor suave, ampliamente disfrutados crudos en ensaladas, sándwiches y como un aperitivo hidratante. Conocidos por su alto contenido de agua, los pepinos ayudan a promover la hidratación y apoyan la piel saludable. También son una buena fuente de vitaminas K y C, así como antioxidantes, ayudando a la digestión y reduciendo la inflamación. Prosperando en climas cálidos y suelo bien drenado, los pepinos son una opción popular y fácil de cultivar para jardines caseros.",
    "ThumbnailImage": "https://www.azamsharp.com/images/cucumber.png",
    "SeedDepth": "1/2-1\" (13-25 mm)",
    "GerminationSoilTemp": "80-95 F (27-35 C)",
    "DaysToGermination": 4,
    "SowIndoors": "3 semanas antes de la helada",
    "SowOutdoors": "Después de la última helada",
    "PhRange": "6.0-7.0",
    "GrowingSoilTemp": "70-80 F (21-27 C)",
    "SpacingBeds": "36 \" (90 cm)",
    "Watering": "Comienza moderado termina pesado",
    "Light": "Sol completo",
    "GoodCompanions": "Frijol arbustivo, brócoli, familia de la col, berenjena",
    "BadCompanions": "Papa",
    "SowingDescription": "Puedes comenzar a plantar pepinos en interiores. Las plantas de pepino no son aficionadas a ser trasplantadas. Ten extremo cuidado y cuidado al ponerlas en el suelo exterior. Cuando el pepino se planta en hileras entonces las semillas deben estar a 2\" a 3\" de distancia. \r",
    "GrowingDescription": "Las plantas de pepino requieren suelo bien drenado. Proporciona mucho fertilizante alto en nitrógeno. También asegúrate de proporcionar mucha agua, para crecimiento rápido.\r",
    "HarvestDescription": "Cosecha pepinos para comer frescos cuando tengan entre 7-9 pulgadas de largo y tengan color verde oscuro brillante. Tamaños más grandes de pepinos tienen sabor amargo. \r",
    "Active": null,
    "Season": "Verano",
    "DaysToHarvestSeeds": 45,
    "DaysToHarvestSeedlings": 30,
    "HealthBenefits": "Los pepinos son hidratantes y ricos en antioxidantes, promoviendo la piel saludable y la digestión.",
    "Pests": [
      {
        "name": "Escarabajos del Pepino",
        "description": "Los escarabajos del pepino son escarabajos pequeños y coloridos con rayas o puntos amarillos y negros, dependiendo de la especie. Son una plaga significativa para plantas cucurbitáceas como pepinos, calabazas, melones y calabazas. Además de alimentarse del follaje, flores y frutos de las plantas, pueden propagar marchitez bacteriana y otras enfermedades de plantas.",
        "symptoms": "Las plantas infestadas con escarabajos del pepino pueden mostrar hojas y flores masticadas, cicatrices en los frutos y crecimiento atrofiado. Signos de marchitez bacteriana, como marchitamiento de hojas y eventual muerte de la planta, también pueden indicar actividad de escarabajos del pepino.",
        "treatment": "Usa cubiertas flotantes de hileras para proteger plantas jóvenes de escarabajos. Aplica aceite de neem o jabón insecticida para disuadir la alimentación. Introduce insectos beneficiosos como moscas taquínidas y escarabajos soldado para ayudar a controlar las poblaciones. Practica rotación de cultivos y retira desechos de plantas al final de la temporada de crecimiento para reducir sitios de hibernación.",
        "photo": "https://www.azamsharp.com/images/cucumber_beetles.png"
      },
      {
        "name": "Chinches de la Calabaza",
        "description": "Las chinches de la calabaza (Anasa tristis) son plagas comunes que atacan plantas de la familia de las cucurbitáceas, incluyendo calabazas, calabazas y zucchinis. Son insectos de forma de escudo, de color gris-marrón que se alimentan de la savia de las plantas, causando daño significativo a los cultivos. Las chinches de la calabaza son particularmente dañinas durante las etapas tempranas de crecimiento de las plantas.",
        "symptoms": "Las plantas infestadas pueden mostrar hojas amarillentas y marchitas, con pardeo o manchas negras en los sitios de alimentación. Las plantas severamente afectadas pueden tener hojas secas y crujientes y crecimiento atrofiado. Los huevos a menudo se pueden encontrar en grupos en la parte inferior de las hojas.",
        "treatment": "Recoge a mano las chinches de la calabaza y destrúyelas para reducir su población. Retira grupos de huevos de las hojas y deséchalos. Usa cubiertas flotantes de hileras para proteger plantas jóvenes. Aplica aceite de neem o jabones insecticidas para manejar infestaciones. Mantén el jardín limpio retirando desechos de plantas, que pueden albergar chinches de la calabaza que hibernan.",
        "photo": "https://www.azamsharp.com/images/squash_bugs.png"
      }
    ]
  },
  {
    "VegetableId": 17,
    "VegetableCode": "011",
    "CatalogId": 2,
    "Name": "Berenjena",
    "Description": "Las berenjenas (Solanum melongena), también conocidas como aubergines, son verduras moradas brillantes y lustrosas con textura esponjosa y sabor suave. Son increíblemente versátiles en la cocina, a menudo usadas en platos como ratatouille, currys y guisos, o asadas y tostadas. Las berenjenas son ricas en fibra, antioxidantes como nasunina, y vitaminas B y K, apoyando la salud del corazón, función cerebral y digestión. Prosperando en climas cálidos con sol completo, las berenjenas son un básico tanto en jardines caseros como en cocinas globales.",
    "ThumbnailImage": "https://www.azamsharp.com/images/eggplant.png",
    "SeedDepth": "1/4 \" (6 mm)",
    "GerminationSoilTemp": "85 F (29 C)",
    "DaysToGermination": 7,
    "SowIndoors": "5 semanas antes de la helada",
    "SowOutdoors": "No recomendado",
    "PhRange": "5.5 - 7.0",
    "GrowingSoilTemp": "80-90 F (27-32 C)",
    "SpacingBeds": "18\" (45 cm)",
    "Watering": "Pesado",
    "Light": "Sol completo",
    "GoodCompanions": "Frijol arbustivo, guisante, pimiento, papa",
    "BadCompanions": "Hinojo",
    "SowingDescription": "Siembra semillas de berenjena en macetas pequeñas a 1/4 de pulgada de profundidad. Riega bien las semillas y asegúrate de que permanezcan húmedas. También puedes cubrir las macetas con plástico. Esto te permitirá monitorear la humedad en las semillas. Si no ves humedad en el plástico entonces es tiempo de añadir más agua. \r",
    "GrowingDescription": "Después de poner las plantas en el jardín usa una cubierta de hileras junto con mantillo para proporcionar calor constante y protección contra los insectos. La berenjena es una de las plantas favoritas para la mayoría de los insectos. Asegúrate de protegerla contra los insectos. Esto puede lograrse cultivando la berenjena bajo cubiertas de hileras.",
    "HarvestDescription": "Cosecha berenjenas en cualquier momento que hayan alcanzado la mitad de su tamaño maduro. Esto proporcionará berenjenas tiernas y deliciosas. Al cortar las berenjenas deja algo de tallo adherido a la planta.",
    "Active": null,
    "Season": "Verano",
    "DaysToHarvestSeeds": 80,
    "DaysToHarvestSeedlings": 60,
    "HealthBenefits": "Las berenjenas contienen antioxidantes como nasunina, que protegen la función cerebral y reducen la inflamación.",
    "Pests": [
      {
        "name": "Escarabajos Pulga",
        "description": "Los escarabajos pulga son insectos pequeños y saltarines que atacan una amplia gama de plantas, incluyendo verduras como tomates, papas, berenjenas y hojas verdes. Estos escarabajos son nombrados por su habilidad de saltar como pulgas cuando son molestados. Su comportamiento de alimentación crea pequeños agujeros en las hojas, dándoles una apariencia de 'agujero de disparo'.",
        "symptoms": "Las plantas infestadas con escarabajos pulga exhiben pequeños agujeros redondos en las hojas, a menudo pareciendo daño de escopeta. Las plántulas jóvenes son particularmente vulnerables, y las infestaciones pesadas pueden llevar a crecimiento atrofiado, vigor reducido e incluso muerte de la planta.",
        "treatment": "Usa cubiertas flotantes de hileras para proteger plántulas de escarabajos pulga. Aplica tierra de diatomeas alrededor de las plantas para disuadirlos. El aceite de neem y jabones insecticidas son tratamientos orgánicos efectivos. Planta cultivos trampa como rábanos para atraer escarabajos lejos de los cultivos principales, y practica rotación de cultivos para minimizar infestaciones futuras.",
        "photo": "https://www.azamsharp.com/images/flea_beetles.png"
      },
      {
        "name": "Ácaros Araña",
        "description": "Los ácaros araña son arácnidos diminutos que se alimentan de la savia de las plantas, a menudo encontrados en la parte inferior de las hojas. Son particularmente problemáticos en condiciones calientes y secas y pueden infestar una amplia gama de plantas, incluyendo verduras, frutas y plantas ornamentales. Los ácaros araña son conocidos por su habilidad de producir telarañas finas en las plantas.",
        "symptoms": "Las plantas infestadas pueden exhibir hojas punteadas o amarillentas con una apariencia bronceada o polvorienta. En infestaciones severas, las hojas pueden caer prematuramente, y telarañas finas pueden encontrarse en la parte inferior de las hojas o entre los tallos de las plantas.",
        "treatment": "Rocía las plantas con un chorro fuerte de agua para desalojar los ácaros araña. Introduce depredadores naturales como mariquitas o ácaros depredadores. Usa aceites hortícolas, aceite de neem o jabones insecticidas para controlar las poblaciones. Mantén niveles adecuados de humedad y asegura riego apropiado para reducir las infestaciones.",
        "photo": "https://www.azamsharp.com/images/spider_mites.png"
      }
    ]
  },
  {
    "VegetableId": 18,
    "VegetableCode": "012",
    "CatalogId": 12,
    "Name": "Apio",
    "Description": "El apio (Apium graveolens) es una verdura crujiente y fibrosa conocida por su sabor suave y refrescante y versatilidad en la cocina. A menudo disfrutado crudo como aperitivo, añadido a ensaladas, o usado como base en sopas y guisos, el apio añade tanto sabor como textura a los platos. Es bajo en calorías y alto en antioxidantes, vitaminas K y C, y fibra dietética, apoyando la digestión, reduciendo la inflamación y promoviendo la salud del corazón. El apio prospera en condiciones frescas y húmedas, haciéndolo un cultivo gratificante para jardines caseros.",
    "ThumbnailImage": "https://www.azamsharp.com/images/celery.png",
    "SeedDepth": "Apenas cubrir",
    "GerminationSoilTemp": "70 F (21 C)",
    "DaysToGermination": 7,
    "SowIndoors": "10 semanas antes de la helada",
    "SowOutdoors": "No recomendado",
    "PhRange": "6.0-7.0",
    "GrowingSoilTemp": "60-70 F (16-21 C)",
    "SpacingBeds": "8\" (20 cm)",
    "Watering": "Pesado y uniforme",
    "Light": "Sol completo",
    "GoodCompanions": "Todo",
    "BadCompanions": "Zanahoria, perejil, chirivía",
    "SowingDescription": "Prepara el suelo añadiendo estiércol o compost. Para dar ventaja al apio remoja las semillas en agua por 2 días. Asegúrate de que la temperatura exterior sea al menos 55 F. Planta las semillas y cúbrelas con tierra.",
    "GrowingDescription": "Durante el período de germinación asegúrate de que el suelo esté húmedo. Riega ligeramente las semillas ya que no quieres que las semillas se laven. Usa mantillo alrededor de la planta para mantener la humedad dentro del suelo. El mantillo también asegurará que no haya malezas creciendo cerca de la planta de apio.",
    "HarvestDescription": "En aproximadamente 5 meses estarás listo para cosechar la planta. Puedes cosechar toda la planta justo en la base.",
    "Active": null,
    "Season": "Verano,Primavera,Otoño,Invierno",
    "DaysToHarvestSeeds": 80,
    "DaysToHarvestSeedlings": 56,
    "HealthBenefits": "El apio es bajo en calorías y alto en antioxidantes, apoyando la salud del corazón y reduciendo la inflamación.",
    "Pests": [
      {
        "name": "Pulgones",
        "description": "Los pulgones son insectos pequeños de cuerpo blando que se alimentan de la savia de las plantas perforando tallos, hojas y brotes con sus partes bucales. Vienen en una variedad de colores, incluyendo verde, amarillo, marrón, rojo y negro, y se reproducen rápidamente, a menudo formando grandes colonias. Los pulgones son plagas comunes de muchos tipos de plantas, incluyendo verduras, frutas y plantas ornamentales.",
        "symptoms": "Las plantas infestadas pueden exhibir hojas curvadas, amarillentas o distorsionadas, crecimiento atrofiado y melaza pegajosa en hojas y tallos. Esta melaza puede llevar al desarrollo de moho negro, que obstaculiza aún más la fotosíntesis. Grandes colonias de pulgones son a menudo visibles en nuevo crecimiento o la parte inferior de las hojas.",
        "treatment": "Introduce depredadores naturales como mariquitas, crisopas o avispas parasíticas para controlar las poblaciones de pulgones. Rocía las plantas con un chorro fuerte de agua para desalojar pulgones. Aplica aceite de neem o jabón insecticida como tratamiento orgánico. Inspecciona regularmente las plantas para signos tempranos de infestación y retira hojas o tallos severamente infestados.",
        "photo": "https://www.azamsharp.com/images/aphids.png"
      },
      {
        "name": "Gorgojos de la Zanahoria",
        "description": "Los gorgojos de la zanahoria (Listronotus oregonensis) son escarabajos pequeños de color marrón oscuro que atacan zanahorias y otras plantas relacionadas, como apio y perejil. Los adultos se alimentan del follaje, mientras que las larvas se entierran en las raíces, causando daño significativo y reduciendo la calidad del cultivo.",
        "symptoms": "Las zanahorias infestadas pueden mostrar pequeños agujeros o túneles en las raíces, que pueden llevar a decoloración, infecciones secundarias y pudrición. Las plantas pueden aparecer atrofiadas o marchitas, especialmente en infestaciones severas.",
        "treatment": "Usa cubiertas flotantes de hileras para prevenir que los gorgojos adultos pongan huevos cerca de las plantas. Retira desechos de plantas y malezas en y alrededor del jardín para eliminar sitios de hibernación. Practica rotación de cultivos para romper el ciclo de vida de la plaga. Los nematodos beneficiosos pueden aplicarse al suelo para atacar las larvas, y pueden usarse insecticidas si es necesario.",
        "photo": "https://www.azamsharp.com/images/carrot_weevils.png"
      }
    ]
  },
  {
    "VegetableId": 19,
    "VegetableCode": "013",
    "CatalogId": 2,
    "Name": "Brócoli",
    "Description": "El brócoli (Brassica oleracea var. italica) es una verdura rica en nutrientes conocida por sus flores en forma de árbol y sabor suave, ligeramente amargo. Un básico en dietas saludables, el brócoli puede disfrutarse al vapor, asado, salteado o crudo en ensaladas. Está lleno de vitaminas C y K, fibra y antioxidantes, apoyando la salud inmune, fuerza ósea y digestión. Prosperando en climas fríos y suelo bien drenado, el brócoli es un favorito entre jardineros por su alto valor nutricional y versatilidad culinaria.",
    "ThumbnailImage": "https://www.azamsharp.com/images/brocalli.png",
    "SeedDepth": "1/4\" (6 mm)",
    "GerminationSoilTemp": "80 F (27 C)",
    "DaysToGermination": 7,
    "SowIndoors": "7 semanas antes de la helada",
    "SowOutdoors": "Principios de verano",
    "PhRange": "6.5-7.5",
    "GrowingSoilTemp": "60-65 F (16-18 C)",
    "SpacingBeds": "16\" (40 cm)",
    "Watering": "Moderado y uniforme",
    "Light": "Sol completo o sombra parcial",
    "GoodCompanions": "Frijol arbustivo, remolacha, zanahoria, apio",
    "BadCompanions": "Frijoles trepadores y de presión, fresa",
    "SowingDescription": "El brócoli no es un cultivador rápido. Puedes comenzar brócoli en interiores 4-6 semanas antes del trasplante. El brócoli funciona mejor a pleno sol. Así que elige un área que reciba al menos 8 horas de sol completo. Añade compost y estiércol en la cama del jardín. Esto asegurará que el suelo esté rico con nutrientes. Planta brócoli en primavera u otoño.",
    "GrowingDescription": "Las plantas de brócoli aman la humedad así que asegúrate de que el suelo esté agradable y húmedo. Busca malezas y asegúrate de que la planta esté libre de malezas e insectos.",
    "HarvestDescription": "El brócoli toma aproximadamente 60-70 días en madurar. Usa un cuchillo para cortar el brote justo debajo de la cabeza.",
    "Active": null,
    "Season": "Otoño,Primavera,Verano,Invierno",
    "DaysToHarvestSeeds": 75,
    "DaysToHarvestSeedlings": 60,
    "HealthBenefits": "El brócoli es rico en vitaminas C y K, así como fibra y antioxidantes que apoyan la salud inmune.",
    "Pests": [
      {
        "name": "Gusanos de la Col",
        "description": "Los gusanos de la col son las larvas de la pequeña mariposa blanca (Pieris rapae), una plaga común de verduras crucíferas como col, brócoli, col rizada y coliflor. Estas orugas verdes tienen una textura aterciopelada y son comedores voraces, causando daño significativo a las plantas.",
        "symptoms": "Las plantas infestadas exhiben agujeros en las hojas, bordes masticados y frass (excrementos de oruga) en el follaje. En casos severos, puede ocurrir defoliación, reduciendo el crecimiento y rendimiento de la planta.",
        "treatment": "Recoge a mano gusanos de la col de las plantas y deséchalos para controlar infestaciones pequeñas. Usa cubiertas flotantes de hileras para prevenir que las mariposas pongan huevos. Aplica Bacillus thuringiensis (Bt) o insecticidas a base de spinosad para control orgánico. Fomenta depredadores naturales, como pájaros o avispas parasíticas, en el jardín.",
        "photo": "https://www.azamsharp.com/images/cabbage_worms.png"
      },
      {
        "name": "Pulgones",
        "description": "Los pulgones son insectos pequeños de cuerpo blando que se alimentan de la savia de las plantas perforando tallos, hojas y brotes. Vienen en varios colores, como verde, amarillo, negro, rojo o marrón, dependiendo de la especie. Los pulgones se reproducen rápidamente y pueden formar grandes colonias, a menudo causando daño significativo a las plantas.",
        "symptoms": "Las plantas infestadas pueden mostrar hojas curvadas, amarillentas o distorsionadas, crecimiento atrofiado y melaza pegajosa en el follaje, que puede atraer hormigas y llevar al crecimiento de moho negro. Grandes colonias de pulgones son a menudo visibles en nuevos brotes o la parte inferior de las hojas.",
        "treatment": "Introduce depredadores naturales, como mariquitas, crisopas y avispas parasíticas, para controlar las poblaciones de pulgones. Rocía las plantas con una corriente fuerte de agua para desalojar pulgones. Aplica aceite de neem o jabones insecticidas para manejo orgánico. Retira las partes severamente infestadas de la planta para prevenir la propagación de pulgones.",
        "photo": "https://www.azamsharp.com/images/aphids.png"
      }
    ]
  },
  {
    "VegetableId": 20,
    "VegetableCode": "014",
    "CatalogId": 2,
    "Name": "Papa",
    "Description": "Las papas (Solanum tuberosum) son verduras de raíz versátiles conocidas por su sabor almidonado y terroso y adaptabilidad culinaria. Un alimento básico mundial, las papas pueden hornearse, hervirse, hacerse puré, freírse o asarse para crear una variedad de platos. Son ricas en carbohidratos, fibra, potasio y vitamina C, proporcionando energía, apoyando la digestión y promoviendo la salud del corazón. Prosperando en suelo bien drenado y climas fríos, las papas son fáciles de cultivar y una favorita entre jardineros caseros.",
    "ThumbnailImage": "https://www.azamsharp.com/images/potato.png",
    "SeedDepth": "3-4\" (7.5-10 cm)",
    "GerminationSoilTemp": "45 F (7 C)",
    "DaysToGermination": 0,
    "SowIndoors": "No recomendado",
    "SowOutdoors": "3 semanas antes de la helada",
    "PhRange": "5.0-6.5",
    "GrowingSoilTemp": "60-65 F (16-18 C)",
    "SpacingBeds": "12\" (30 cm)",
    "Watering": "Moderado",
    "Light": "Sol completo",
    "GoodCompanions": "Frijol arbustivo, maíz, caléndula, chirivía, guisante",
    "BadCompanions": "Pepino, tomate, nabo",
    "SowingDescription": "Las papas pueden cultivarse en casi todas las estaciones ya que diferentes variedades de papas requieren diferentes climas. Las papas requieren un suelo profundo y bien drenado en lugar de un suelo rico y altamente nutritivo. Planta la papa 10-12 pulgadas de profundidad. Esto asegurará que la humedad se retenga en el suelo.",
    "GrowingDescription": "Principios de primavera es el mejor momento para plantar papas. Las papas pequeñas pueden plantarse enteras mientras que las más grandes pueden cortarse en pedazos. Asegúrate de controlar las malezas alrededor de las papas. Añade algo de mantillo alrededor del área plantada que no permitirá que crezcan malezas.",
    "HarvestDescription": "Finales de verano o principios de otoño estás listo para sacar una papa cultivada. Asegúrate de tener mucho cuidado al cavar las papas ya que no quieres deslizarte a través de los tubérculos enterrados.",
    "Active": null,
    "Season": "Verano,Primavera,Otoño,Invierno",
    "DaysToHarvestSeeds": 120,
    "DaysToHarvestSeedlings": 90,
    "HealthBenefits": "Las papas son una buena fuente de potasio, vitamina C y fibra, promoviendo la salud del corazón y la digestión.",
    "Pests": [
      {
        "name": "Escarabajo de la Papa",
        "description": "El escarabajo de la papa, también conocido como escarabajo de Colorado de la papa (Leptinotarsa decemlineata), es una plaga común de papas, tomates y berenjenas. Estos escarabajos son amarillo-naranja con rayas negras en sus alas, y sus larvas son rojizas con manchas negras. Tanto adultos como larvas se alimentan vorazmente del follaje de las plantas, llevando a daño significativo del cultivo.",
        "symptoms": "Las plantas infestadas con escarabajos de papa pueden exhibir defoliación, comenzando con pequeños agujeros en las hojas y progresando a pérdida completa de hojas. Las infestaciones severas pueden debilitar las plantas, reducir rendimientos e incluso causar muerte de la planta. Grupos de huevos naranjas pueden ser visibles en la parte inferior de las hojas.",
        "treatment": "Recoge a mano escarabajos y larvas de las plantas y destrúyelos. Usa cubiertas flotantes de hileras para prevenir que los escarabajos alcancen las plantas. Aplica Bacillus thuringiensis (Bt) o insecticidas a base de spinosad para control orgánico. Introduce depredadores naturales como mariquitas y crisopas para reducir las poblaciones de escarabajos. La rotación de cultivos y remoción de desechos de plantas al final de la temporada puede ayudar a interrumpir su ciclo de vida.",
        "photo": "https://www.azamsharp.com/images/potato_beetle.png"
      },
      {
        "name": "Gusanos de Alambre",
        "description": "Los gusanos de alambre son las larvas de escarabajos clic y son conocidos por sus cuerpos duros y alargados que se parecen a alambres. Atacan principalmente las raíces y tallos subterráneos de plantas, incluyendo papas, zanahorias, maíz y trigo. Los gusanos de alambre pueden sobrevivir en el suelo por varios años, haciéndolos una plaga persistente en entornos agrícolas y de jardín.",
        "symptoms": "Las plantas infestadas con gusanos de alambre pueden exhibir germinación pobre, crecimiento atrofiado y marchitamiento. Al inspeccionar, las raíces y tubérculos pueden tener pequeños agujeros redondos causados por la alimentación de gusanos de alambre. En casos severos, el daño puede llevar a infecciones secundarias y muerte de la planta.",
        "treatment": "Practica rotación de cultivos para reducir las poblaciones de gusanos de alambre en el suelo. Usa trampas de cebo, como pedazos de papa enterrados, para monitorear y capturar gusanos de alambre. Aplica nematodos beneficiosos al suelo para atacar las larvas. Evita plantar cultivos susceptibles en campos con historial conocido de gusanos de alambre, y considera tratamientos de suelo con insecticidas aprobados para infestaciones severas.",
        "photo": "https://www.azamsharp.com/images/wireworms.png"
      }
    ]
  }
]

